trade_exp/src/Documents/Пропуск/Пропуск.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="40c6e6cf-b72f-4a58-bb30-ef44407a6c36">
  <name>Пропуск</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes extendedConfigurationObject="caf247e2-4077-447f-b4fc-57f2b91b3323">
    <name>Доступ</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="12cf2cfc-6806-4e64-a645-8eae5aba9e37">
    <name>Подразделение</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="ba331897-fef1-466b-a64b-e88432d8bfed">
    <name>ТипПропуска</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="c82a20e8-4ecc-4edf-9443-2a129787f88d">
    <name>ЦельПосещения</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="e07e4292-e551-4bc1-881d-20c85b4b9130">
    <name>Расшифровка</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>1000</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="0737fcab-2209-423b-9ac2-108aeaf19802">
    <name>ФИО</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="27a561ad-aa27-442d-be21-2caf93c2a208">
    <name>ВидТранспортногоСредства</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>200</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="b8b8bab6-8256-4375-8149-d48184352abe">
    <name>НаименованиеОрганизации</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>200</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="37f0c450-580f-4ac0-95ae-d5b9d95155fa">
    <name>Автор</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="44dd51fe-efa5-42f6-8f36-d29ec59c7464">
    <name>Комментарий</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>1000</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="d0562081-ea83-4c76-b366-04c8aa0d79a0">
    <name>ТипПрохода</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="3d7be871-19e4-4d23-bedb-1c53b2a1a08f">
    <name>ТребуетсяПодтверждение</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="6abb30b9-96c0-4f1e-904d-30130b54f3fa">
    <name>ДатаНачала</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="d61bf324-c1d8-45b2-9921-23411a373306">
    <name>ДатаОкончания</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="5f37c12d-794f-4909-8515-13506af8c440">
    <name>Прекращен</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="3789b914-6a24-4b5d-935e-9a5357ce0cef">
    <name>Основание</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="9247de40-43c3-41a1-b013-2d5a9c7c42fd">
    <name>РазрешеноУстанавливатьПериодНеПозднее</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="d900407b-bf13-4559-9b94-d77a215eb1b3">
    <name>QRкод</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>15</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
</mdclass:Document>

trade_exp/src/Catalogs/Отделы/Отделы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="185e8ada-3ead-4fe0-ba9f-7aa6f38fdec9">
  <name>Отделы</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <hierarchical>Checked</hierarchical>
  </extension>
  <hierarchical>true</hierarchical>
  <attributes extendedConfigurationObject="11e387f3-54db-4496-ad7b-06da8f792e73">
    <name>Секция</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="4f190465-8417-419b-8aba-b08c44f1381c">
    <name>ГрафикРаботы</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="a83eb5ec-5c8c-4666-ab48-1906e7d68823">
    <name>Руководитель</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="29965ef5-fb06-4b3d-9add-ecdd687031a0">
    <name>ИзменятьПодразделение</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="f5f9d143-4a06-49e2-bb8d-855ab3318513">
    <name>ИзменятьТипПропуска</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="c8de732e-42ad-4635-a3a9-c2528b778cad">
    <name>УровеньДоступа</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="9344b6ff-f02a-4c5b-ad60-a91807edf87e">
    <name>ЗапретитьСоздаватьПропуск</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="df94b4fc-8646-43ca-b344-fb1a1ce8f0f2">
    <name>ЦельПоУмолчанию</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="388216eb-779b-43cf-af83-f29c6389729f">
    <name>ИзменятьЦель</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="7181374d-e109-40a4-abc7-b447da5d30f4">
    <name>ИзменятьТребуетПодтверждение</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="662ddfb0-40cb-4323-9382-c3a57c6241b1">
    <name>УстанавливатьПериодНеПозднее</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="3fb68ed7-b552-4957-a4a7-308c80a4b197">
    <name>ИдентификаторАстерикс</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="eaff3ee1-6abe-4021-b5fe-b1484b94e6d0">
    <name>Подразделение</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="da752511-61de-4f01-a166-216839c92e11">
    <name>ВнутреннийТелефон</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="9f6d87ce-cb27-41e1-a72f-e5290739fc24">
    <name>КорпоративныйТелефон</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <tabularSections extendedConfigurationObject="4c64d903-4c47-4645-aa2a-dc29f8918424">
    <name>СписокЗон</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="1111ed8c-d901-4d0e-8970-a72ac74d223d">
      <name>ЗонаДоступа</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

trade_exp/src/Documents/Пропуск/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область Печать 

Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "Пропуск") Тогда
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "Пропуск", НСтр("ru = 'Пропуск'"), СформироватьПечатнуюФормуПропуска(МассивОбъектов, "Пропуск"));
	КонецЕсли;
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ПропускЭтикетка") Тогда
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "ПропускЭтикетка", НСтр("ru = 'ПропускЭтикетка'"), СформироватьПечатнуюФормуПропуска(МассивОбъектов, "ПропускЭтикетка"));
	КонецЕсли;
	
КонецПроцедуры

Функция СформироватьПечатнуюФормуПропуска(Документ, ПечататьМакет) Экспорт
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	Если ПечататьМакет = "Пропуск" Тогда 
		Макет = ПолучитьМакет("Пропуск");
	Иначе 
		Макет = ПолучитьМакет("ПропускЭтикетка");
	КонецЕсли;
		
	
	ОбластьШапка = Макет.ПолучитьОбласть("ОбластьШапка");
	ОбластьПодвал = Макет.ПолучитьОбласть("ОбластьПодвал");

	
	
	Выборка = ЗапросФормированиеПечатнойФормыПропуска(Документ.Ссылка);
	Выборка.Следующий();
	
	//Если Выборка.Доступ.Наименование = "Склад Барнаул" Тогда   //Если Барнаул - то QR код на печать
		
		ОбластьQRкода = Макет.ПолучитьОбласть("ОбластьQRкода");;
		ДанныеQRКода = ГенерацияШтрихкода.ДанныеQRКода(Выборка.QrКод, 1, 400);
  		КартинкаQRКода = Новый Картинка(ДанныеQRКода);
 		ОбластьQRкода.Рисунки.QRКод.Картинка = КартинкаQRКода;
		ТабличныйДокумент.Вывести(ОбластьQRкода);
	//Иначе
	//	ОбластьШтрихкода = Макет.ПолучитьОбласть("ОбластьШтрихкода"); //Для других - штрихкод	
	//	ШтрихкодированиеПечатныхФорм.ВывестиШтрихкодВТабличныйДокумент(ТабличныйДокумент, Макет, ОбластьШтрихкода, Документ.Ссылка);
	//	ТабличныйДокумент.Вывести(ОбластьШтрихкода);
	//	
	//КонецЕсли; 

	
	ЗаполнитьЗначенияСвойств(ОбластьШапка.Параметры, Выборка);
	ОбластьШапка.Параметры.ПериодПрохода = "" + Формат(Выборка.ДатаНачала, "ДФ=dd.MM.yy") + " - " + Формат(Выборка.ДатаОкончания, "ДФ=dd.MM.yy");
	ОбластьШапка.Параметры.ЦельПосещения = "" + Выборка.ЦельПосещ + ?(Выборка.Расшифровка = "", "", ", ") + Выборка.Расшифровка; 
	ТабличныйДокумент.Вывести(ОбластьШапка);
 
	ЗаполнитьЗначенияСвойств(ОбластьПодвал.Параметры, Выборка);
	Если Выборка.ТребуетсяПодтверждение Тогда
		ОбластьПодвал.Параметры.Пометка = "Требует подтверждения на КПП"; 
	КонецЕсли;
	ТабличныйДокумент.Вывести(ОбластьПодвал);
	
	ТабличныйДокумент.АвтоМасштаб = Истина;
	ТабличныйДокумент.ТолькоПросмотр = Истина;
	ТабличныйДокумент.ОтображатьСетку = Ложь;
	
	Если ПечататьМакет = "ПропускЭтикетка" Тогда
		ТабличныйДокумент.ПолеСверху = 0;
		ТабличныйДокумент.ПолеСлева = 0;
		ТабличныйДокумент.ПолеСнизу = 0;
		ТабличныйДокумент.ПолеСправа = 0;
		ТабличныйДокумент.РазмерКолонтитулаСверху = 0;
		ТабличныйДокумент.РазмерКолонтитулаСнизу = 0;	
	КонецЕсли;

	Возврат ТабличныйДокумент;
	
КонецФункции

Функция ЗапросФормированиеПечатнойФормыПропуска(СсылкаНаДокумент)
	
    Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Пропуск.Дата КАК Дата,
	|	Пропуск.Номер КАК Номер,
	|	Пропуск.ТипПрохода КАК ТипПрохода,
	|	Пропуск.ДатаНачала КАК ДатаНачала,
	|	Пропуск.ДатаОкончания КАК ДатаОкончания,
	|	Пропуск.Подразделение КАК Подразделение,
	|	Пропуск.Доступ КАК Доступ,
	|	Пропуск.Расшифровка КАК Расшифровка,
	|	Пропуск.ФИО КАК ФИО,
	|	Пропуск.ВидТранспортногоСредства КАК ВидТС,
	|	Пропуск.НаименованиеОрганизации КАК Организация,
	|	Пропуск.Комментарий КАК Комментарий,
	|	Пропуск.Автор КАК Автор,
	|	Пропуск.ТипПропуска КАК ТипПропуска,
	|	Пропуск.ЦельПосещения КАК ЦельПосещ,
	|	Пропуск.Подразделение.Адрес КАК АдресПодразделения,
	|	Пропуск.ТребуетсяПодтверждение КАК ТребуетсяПодтверждение,
	|	Пропуск.QRкод КАК QRкод
	|ИЗ
	|	Документ.Пропуск КАК Пропуск
	|ГДЕ
	|	Пропуск.Ссылка = &Ссылка";
	Запрос.УстановитьПараметр("Ссылка", СсылкаНаДокумент);
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	
	Возврат Выборка;
	
КонецФункции

#КонецОбласти

Процедура ЗаполнитьДанныеПоОснованию(Основание, Объект) Экспорт	
	
	УстановитьПривилегированныйРежим(Истина);

	ТекПользователь = Пользователи.ТекущийПользователь();
	Объект.Автор = ТекПользователь;
	Объект.ТипПропуска = Перечисления.ТипыПропусков.Разовый;
	
	ПараметрыИзСправочника = ПараметрыСотрудника(ТекПользователь);

	Если ПараметрыИзСправочника.Количество() = 0 Тогда 
		Возврат;
	Иначе
		Параметры = ПараметрыИзСправочника[0];
	КонецЕсли;
	Объект.РазрешеноУстанавливатьПериодНеПозднее = Параметры.УстанавливатьПериодНеПозднее;
	
	Если Основание = Неопределено ИЛИ ТипЗнч(Основание) = Тип("Структура") Тогда
		 Объект.Подразделение = Параметры.Подразделение;
	КонецЕсли;

	Если Основание = Неопределено Тогда
		Объект.ЦельПосещения = Параметры.ЦельПоУмолчанию; 
		Возврат;
	КонецЕсли;
	
	Если ТипЗнч(Основание) = Тип("Структура") Тогда
		Если Основание.Свойство("ЦельПосещения") И Основание.Свойство("ЗонаДоступа") Тогда 
			Объект.ЦельПосещения = Основание.ЦельПосещения;
			Объект.Доступ = Основание.ЗонаДоступа;
			Если Основание.ЦельПосещения = Справочники.ЦелиПосещения.Аутсорс ИЛИ Основание.ЦельПосещения = Справочники.ЦелиПосещения.Собеседование Тогда	
				Объект.ТипПрохода = Перечисления.ТипыПрохода.Вход;
			Иначе
				Объект.ТипПрохода = Перечисления.ТипыПрохода.Въезд;
			КонецЕсли;
			Объект.ДатаНачала = ТекущаяДата();
			Объект.ДатаОкончания = КонецДня(ТекущаяДата());
		КонецЕсли;
	Иначе
		Объект.Основание = Основание;
		Объект.ЦельПосещения = Справочники.ЦелиПосещения.ОсмотрТовара;
		Объект.Подразделение = Основание.Подразделение;
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры

Функция ПараметрыСотрудника(Пользователь) 
	
	Сотрудник = АльтерраОбщегоНазначения.ПолучитьСотрудника(Пользователь);
	
	Запрос = Новый Запрос;
	Если Сотрудник.Индивидуально Тогда
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	Сотрудники.УстанавливатьПериодНеПозднее КАК УстанавливатьПериодНеПозднее,
		|	Сотрудники.ЦельПоУмолчанию КАК ЦельПоУмолчанию,
		|	Сотрудники.Подразделение КАК Подразделение
		|ИЗ
		|	Справочник.Сотрудники КАК Сотрудники
		|ГДЕ
		|	Сотрудники.Ссылка = &Сотрудник";
	Иначе
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	Отделы.УстанавливатьПериодНеПозднее КАК УстанавливатьПериодНеПозднее,
		|	Отделы.ЦельПоУмолчанию КАК ЦельПоУмолчанию,
		|	Сотрудники.Подразделение КАК Подразделение
		|ИЗ
		|	Справочник.Сотрудники КАК Сотрудники
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Отделы КАК Отделы
		|		ПО (Сотрудники.Отдел = Отделы.Ссылка)
		|ГДЕ
		|	Сотрудники.Ссылка = &Сотрудник";	
	КонецЕсли;
	Запрос.УстановитьПараметр("Сотрудник", Сотрудник);
	Результат = Запрос.Выполнить().Выгрузить();
	
	Возврат Результат;
	
КонецФункции


#КонецЕсли
